archive/before-2018-11-10/2017-07-20-emacs在多个文件的多个位置跳转.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs在多个文件的多个位置跳转</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">emacs在多个文件的多个位置跳转</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org725a84e">1. 安装</a></li>
<li><a href="#org62e54fc">2. 使用</a></li>
</ul>
</div>
</div>
<p>
之前我写过一篇 <a href="2017-06-05-Emacs%E5%A6%82%E4%BD%95%E6%9A%82%E5%AD%98windows_layout.html">Emacs如何暂存windows_layout</a> 。可以保存窗口布局和位置。
但是实际编程时，我可能会遇到很长的文件，如需要同时修改100行，888行，
1500行。或者是一个功能需要修改同时多个文件的多个地方，常见的server和
client编程时，如果修改了消息格式，那么client和server两端都需要修改。这
个时候光记住窗口布局显然是有点不够了。
</p>

<p>
这个插件这可以派上用场啦 <a href="https://github.com/joodland/bm">bm</a> 。
</p>

<div id="outline-container-org725a84e" class="outline-2">
<h2 id="org725a84e"><span class="section-number-2">1</span> 安装</h2>
<div class="outline-text-2" id="text-1">
<p>
我是直接使用 package-install 安装的。如果网络不好，可以参考 <a href="2017-07-21-emacs%E4%BD%BF%E7%94%A8%E6%9C%AC%E5%9C%B0package%E6%9D%A5%E5%AE%89%E8%A3%85%E8%BD%AF%E4%BB%B6.html">emacs使
用本地package来安装软件</a> .
</p>
</div>
</div>

<div id="outline-container-org62e54fc" class="outline-2">
<h2 id="org62e54fc"><span class="section-number-2">2</span> 使用</h2>
<div class="outline-text-2" id="text-2">
<p>
常用的函数有这些：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">函数名</th>
<th scope="col" class="org-left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">bm-toggle</td>
<td class="org-left">在当前行标记或反标记一个tag</td>
</tr>

<tr>
<td class="org-left">bm-bookmark-regexp</td>
<td class="org-left">把满足regexp的行都打上tag</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">bm-next</td>
<td class="org-left">跳到下一个tag</td>
</tr>

<tr>
<td class="org-left">bm-previous</td>
<td class="org-left">跳到上一个tag</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">bm-show-all</td>
<td class="org-left">显示所有的tag</td>
</tr>

<tr>
<td class="org-left">bm-show</td>
<td class="org-left">显示当前buffer的tag</td>
</tr>

<tr>
<td class="org-left">helm-bm</td>
<td class="org-left">使用helm调出bm，可以通过输入来过滤</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">peng-bm-remove-all-all-buffers</td>
<td class="org-left">删除所有的tag</td>
</tr>

<tr>
<td class="org-left">peng-bm-remove-current-buffer</td>
<td class="org-left">删除当前buffer的tag</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">bm-toggle-buffer-persistence</td>
<td class="org-left">设置当前buffer中的tag为永久的</td>
</tr>

<tr>
<td class="org-left">bm-save</td>
<td class="org-left">保存所有设置为永久的tag到文件</td>
</tr>

<tr>
<td class="org-left">bm-load-and-restore</td>
<td class="org-left">从文件中加载tag到buffer</td>
</tr>
</tbody>
</table>

<p>
我使用hydra，所以这样定义一个：
</p>
<div class="org-src-container">
<pre class="src src-elisp">    (<span style="color: #a1db00;">defhydra</span> hydra-local-bookmark-menu (<span style="color: #d18aff;">:exit</span> t
                                               <span style="color: #d18aff;">:columns</span> 3)
      <span style="color: #ff4b4b;">"Local bookmark"</span>
      (<span style="color: #ff4ea3;">"t"</span> bm-toggle <span style="color: #ff4ea3;">"toggle"</span>)
      (<span style="color: #ff4ea3;">"P"</span> bm-toggle-buffer-persistence <span style="color: #ff4ea3;">"toggle buffer persistence"</span>)
      (<span style="color: #ff4ea3;">"n"</span> bm-next <span style="color: #ff4ea3;">"next"</span> <span style="color: #d18aff;">:exit</span> nil)
      (<span style="color: #ff4ea3;">"p"</span> bm-previous <span style="color: #ff4ea3;">"previours"</span> <span style="color: #d18aff;">:exit</span> nil)
      (<span style="color: #ff4ea3;">"s"</span> bm-show-all <span style="color: #ff4ea3;">"show all"</span>)
      (<span style="color: #ff4ea3;">"S"</span> bm-save <span style="color: #ff4ea3;">"save all bookmark to disk"</span>)
      (<span style="color: #ff4ea3;">"L"</span> bm-load-and-restore <span style="color: #ff4ea3;">"load bookmark from disk"</span>)
      (<span style="color: #ff4ea3;">"l"</span> bm-show <span style="color: #ff4ea3;">"show current file"</span>)
      (<span style="color: #ff4ea3;">"d"</span> peng-bm-remove-all-all-buffers <span style="color: #ff4ea3;">"remove all"</span>)
      (<span style="color: #ff4ea3;">"c"</span> peng-bm-remove-current-buffer <span style="color: #ff4ea3;">"remove current file"</span>)
      (<span style="color: #ff4ea3;">"h"</span> helm-bm <span style="color: #ff4ea3;">"helm bm"</span>)
      (<span style="color: #ff4ea3;">"RET"</span> nil <span style="color: #ff4ea3;">"cancel"</span>)
      (<span style="color: #ff4ea3;">"&lt;return&gt;"</span> nil <span style="color: #ff4ea3;">"cancel"</span>)
      )
</pre>
</div>
<p>
然后随便绑定到一个按键就是啦：
</p>
<div class="org-src-container">
<pre class="src src-elisp">    (global-set-key (kbd <span style="color: #ff4ea3;">"C-c t"</span>) 'hydra-local-bookmark-menu/body)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>